<a href="https://colab.research.google.com/github/npr99/PlanningMethods/blob/master/Location_Quotient_Using_BLS_QCEW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Location Quotient Example Using BLS QCEW

The Bureau of Labor Statistics provides employment and wage data by year, county, state, and nation by industry.

An overview of this data is available on the BLS website for the Quarterly Census of Employment and Wages (QCEW) data

https://www.bls.gov/cew/

The BLS provides data in "data slices" - for individual states and counties.

https://data.bls.gov/cew/doc/access/csv_data_slices.htm

The BLS provides a complete layout of the datasets - specifically for Location Quotient the Annual Average data is a good choice:

https://data.bls.gov/cew/doc/access/csv_data_slices.htm#ANNUAL_LAYOUT

The BLS provides a complete list of Areas (states and counties) - the "area codes" are based on the state and county FIPS codes:

https://data.bls.gov/cew/doc/titles/area/area_titles.htm

### Example Area Slice Files

2016 QCEW Annual averages for Georgia
http://data.bls.gov/cew/data/api/2016/a/area/13000.csv

2016 QCEW Annual averages for Chatham County, GA
http://data.bls.gov/cew/data/api/2016/a/area/13051.csv

### File Layout
https://www.bls.gov/cew/about-data/downloadable-file-layouts/annual/naics-based-annual-layout.htm

#### Details on codes for different ownership types:
https://www.bls.gov/cew/classifications/ownerships/ownership-titles.htm


Note totals for employment are the sums of all Annual average of monthly employment levels for a given year (annual_avg_emplvl) for all ownership codes.

### BLS data as time series
Chatham County QCEW Time Series Data
https://data.bls.gov/timeseries/ENU1305110010

## Step 1: Obtain BLS QCEW Data File
The Pandas read csv command is a fast way to download .csv datafiles directly to the notebook session.

In [3]:
import pandas as pd # For reading, writing and wrangling data

In [4]:
blsqcew_areatitles = pd.read_csv('https://data.bls.gov/cew/doc/titles/area/area_titles.csv')
blsqcew_areatitles.head()

  area_fips                                      area_title
0     US000                                      U.S. TOTAL
1     USCMS      U.S. Combined Statistical Areas (combined)
2     USMSA  U.S. Metropolitan Statistical Areas (combined)
3     USNMS   U.S. Nonmetropolitan Area Counties (combined)
4     01000                            Alabama -- Statewide

In [5]:
# Find Area FIPS code based on county name
blsqcew_areatitles.loc[blsqcew_areatitles['area_title'] == 'Chatham County, Georgia']

    area_fips               area_title
486     13051  Chatham County, Georgia

In [6]:
# Save Area Title for later use
area_title_df = blsqcew_areatitles.loc[blsqcew_areatitles['area_fips'] == '13051']
area_title = area_title_df['area_title'].values[0]
area_title

'Chatham County, Georgia'

In [7]:
blsqcew = pd.read_csv('http://data.bls.gov/cew/data/api/2016/a/area/US000.csv')
blsqcew.head()

  area_fips  own_code  ... oty_avg_annual_pay_chg  oty_avg_annual_pay_pct_chg
0     US000         0  ...                    679                         1.3
1     US000         1  ...                    479                         0.6
2     US000         1  ...                   1283                         1.7
3     US000         1  ...                  -1896                        -2.9
4     US000         1  ...                  -6705                        -6.2

[5 rows x 38 columns]

## Step 3: Explore Data
Look at descripitive statistics for key variabiables.

In [8]:
# Explore the Location quotient of annual average employment relative to the U.S. (Rounded to the hundredths place)
blsqcew[['annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages',]].describe()

       annual_avg_estabs  ...  lq_total_annual_wages
count       4.583000e+03  ...            4583.000000
mean        2.125358e+04  ...               0.821732
std         2.844505e+05  ...               0.382780
min         0.000000e+00  ...               0.000000
25%         8.000000e+00  ...               1.000000
50%         3.450000e+02  ...               1.000000
75%         3.737000e+03  ...               1.000000
max         9.716618e+06  ...               1.000000

[8 rows x 4 columns]

# Look at top Location Quotients by industry

## Full list of industry codes
For a full list of industry codes use the link below:

https://www.bls.gov/cew/classifications/industry/industry-titles.htm


## More details on NAICS
North American Industry Classification System (NAICS) 

https://www.naics.com/search/

## NAICS FAQ
https://www.naics.com/frequently-asked-questions/#NAICSfaq

## Add Industry Titles
The current industry titles were updated in 2017. The list of industries appears to be backwards compatitle and includes codes for all previous years and updated codes. The BLS website has a number of tables that help identify new NAICS codes and how they map to older NAICS codes. Most of the changes appear to be at the 4, 5, and 6 digit NAICS code levels.

"For detailed information on QCEW establishment, employment, and wage levels for each industry affected by the NAICS 2017 conversion, please refer to this [QCEW 2017 revision table](https://data.bls.gov/cew/apps/bls_naics/naics2017.xls)."

In [9]:
industry_titles_df = pd.read_csv('https://www.bls.gov/cew/classifications/industry/industry-titles-csv.csv')
industry_titles_df.head()

  industry_code                     industry_title
0            10           10 Total, all industries
1           101                101 Goods-producing
2          1011  1011 Natural resources and mining
3          1012                  1012 Construction
4          1013                 1013 Manufacturing

In [10]:
industry_titles_df.industry_code.describe()

count     2497
unique    2497
top        721
freq         1
Name: industry_code, dtype: object

In [11]:
blsqcew_titles = pd.merge(left = industry_titles_df,
                          right = blsqcew,
                          left_on = 'industry_code',
                          right_on = 'industry_code',
                          how = 'outer')
blsqcew_titles.head()

  industry_code  ... oty_avg_annual_pay_pct_chg
0            10  ...                        1.3
1            10  ...                        0.6
2            10  ...                        2.3
3            10  ...                        1.8
4            10  ...                        1.2

[5 rows x 39 columns]

In [12]:
blsqcew_titles.industry_code.describe()

count     4836
unique    2497
top         10
freq         7
Name: industry_code, dtype: object

In [13]:
import numpy as np
blsqcew_titles[['industry_code','industry_title','annual_avg_emplvl']].\
loc[blsqcew_titles['annual_avg_emplvl'].isnull()].head()

    industry_code  ... annual_avg_emplvl
297         21112  ...               NaN
298        211120  ...               NaN
299         21113  ...               NaN
300        211130  ...               NaN
315        212230  ...               NaN

[5 rows x 3 columns]

In [14]:
blsqcew_titles[['industry_title','annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages']].sort_values(by='lq_annual_avg_emplvl', ascending=False).head(10)

                                         industry_title  ...  lq_total_annual_wages
0                              10 Total, all industries  ...                    1.0
3313                  NAICS 54192 Photographic services  ...                    1.0
3186  NAICS 541511 Custom computer programming services  ...                    1.0
3187  NAICS 541511 Custom computer programming services  ...                    1.0
3188  NAICS 541511 Custom computer programming services  ...                    1.0
3189  NAICS 541511 Custom computer programming services  ...                    1.0
3190      NAICS 541512 Computer systems design services  ...                    1.0
3191      NAICS 541512 Computer systems design services  ...                    1.0
3192      NAICS 541512 Computer systems design services  ...                    1.0
3193  NAICS 541513 Computer facilities management se...  ...                    1.0

[10 rows x 5 columns]

Look at top industries by employement.

In [15]:
blsqcew_titles[['industry_title','annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages']].sort_values(by='annual_avg_emplvl', ascending=False).head(10)

                                  industry_title  ...  lq_total_annual_wages
0                       10 Total, all industries  ...                    1.0
6                       10 Total, all industries  ...                    1.0
4                       10 Total, all industries  ...                    1.0
26                         102 Service-providing  ...                    1.0
30     1021 Trade, transportation, and utilities  ...                    1.0
46            1025 Education and health services  ...                    1.0
5                       10 Total, all industries  ...                    1.0
10                           101 Goods-producing  ...                    1.0
42       1024 Professional and business services  ...                    1.0
3713  NAICS 62 Health care and social assistance  ...                    1.0

[10 rows x 5 columns]

## Identify the NAICS Code by lengths

In [17]:
blsqcew_titles.loc[:,'NAICS digits'] = 0
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.len()==2) |
    (blsqcew_titles['industry_code'].str.contains("-")),'NAICS digits'] = 2
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.len()==3),'NAICS digits'] = 3
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.len()==4),'NAICS digits'] = 4
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.len()==5),'NAICS digits'] = 5
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.len()==6),'NAICS digits'] = 6
blsqcew_titles.loc[(blsqcew_titles['industry_code'].str.startswith('10')),'NAICS digits'] = 0
blsqcew_titles.\
pivot_table(values='annual_avg_emplvl',index = 'NAICS digits',aggfunc=np.sum)

              annual_avg_emplvl
NAICS digits
0                   727922790.0
2                   107909688.0
3                   141851820.0
4                   141842283.0
5                   175620454.0
6                   141608635.0

In [24]:
blsqcew_titles[['NAICS digits','industry_title']].loc[blsqcew_titles['NAICS digits']==2].head()

     NAICS digits                                     industry_title
62              2  NAICS 11 Agriculture, forestry, fishing and hu...
63              2  NAICS 11 Agriculture, forestry, fishing and hu...
64              2  NAICS 11 Agriculture, forestry, fishing and hu...
65              2  NAICS 11 Agriculture, forestry, fishing and hu...
286             2  NAICS 21 Mining, quarrying, and oil and gas ex...

In [21]:
#blsqcew_titles[['NAICS digits','industry_code']].tail(50)

Look at summary data by 2-digit NAICS code and Ownership Code.

In [25]:
blsqcew_2digit = blsqcew_titles[['industry_code','industry_title','own_code','annual_avg_estabs','annual_avg_emplvl']].\
loc[(blsqcew_titles['NAICS digits']==2)].sort_values(by=['industry_code','own_code'])
varformat = {('annual_avg_emplvl'): "{:,.0f}", ('annual_avg_estabs'):"{:,.0f}"}
blsqcew_2digit.head(8).style\
     .format(varformat)

Total jobs appears to be the toal of own code 9 (Total U.I. Covered (Excludes Federal Government)) and own code 1 (Federal Government).

In [33]:
#  Need to drop total covered - own_code == 0 - leads to double counting
blsqcew_totalcovered = blsqcew_titles[['industry_code','industry_title','own_code','annual_avg_estabs','annual_avg_emplvl']].loc[(blsqcew_titles['own_code'] ==0)]
blsqcew_totalcovered.head()

  industry_code            industry_title  ...  annual_avg_estabs  annual_avg_emplvl
0            10  10 Total, all industries  ...          9716618.0        141870066.0

[1 rows x 5 columns]

In [28]:
# Replace Industry code for NAICS 92 to get levels of government
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92')]

     industry_code  ... annual_avg_emplvl
4597            92  ...         1518776.0
4598            92  ...         1787601.0
4599            92  ...         4001440.0

[3 rows x 5 columns]

In [29]:
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==1),'industry_code'] = '92 1 Federal Government'
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==2),'industry_code'] = '92 2 State Government'
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==3),'industry_code'] = '92 3 Local Government'

In [30]:
table1 = blsqcew_2digit.groupby(by=["industry_code","industry_title"]).sum()
table1.reset_index(inplace = True)
table_title = "Two-digit NAICS, "+area_title
varformat = {('annual_avg_emplvl'): "{:,.0f}", ('annual_avg_estabs'):"{:,.0f}"}
table1.style\
     .set_caption(table_title)\
     .format(varformat)

# Create a function that obtains and cleans BLS data

In [71]:
import pandas as pd # For reading, writing and wrangling data
import sys  # saving CSV files

def obtain_clean_bls(area_fips: str = "US000", year: str = "2016"):
  """
  area_fips = 5 character string
  """
  blsqcew_areatitles = pd.read_csv('https://data.bls.gov/cew/doc/titles/area/area_titles.csv')
  blsqcew = pd.read_csv('http://data.bls.gov/cew/data/api/'+year+'/a/area/'+area_fips+'.csv')
  
  # Save Area Title for later use
  area_title_df = blsqcew_areatitles.loc[blsqcew_areatitles['area_fips'] == area_fips]
  area_title = area_title_df['area_title'].values[0]

  # Add industry titles
  industry_titles_df = pd.read_csv('https://www.bls.gov/cew/classifications/industry/industry-titles-csv.csv')
  blsqcew_titles = pd.merge(left = industry_titles_df,
                            right = blsqcew,
                            left_on = 'industry_code',
                            right_on = 'industry_code',
                            how = 'right')
  
  # Look at summary data by 2-digit NAICS code and Ownership Code
  blsqcew_2digit = blsqcew_titles[['industry_code','industry_title','own_code','annual_avg_estabs','annual_avg_emplvl']].\
  loc[(blsqcew_titles['industry_code'].str.len()==2) |
      (blsqcew_titles['industry_code'].str.contains("-"))].sort_values(by=['industry_code','own_code'])

  #  Need to drop total covered - own_code == 0, 8 and 9 - leads to double counting
  blsqcew_2digit = blsqcew_2digit.loc[(blsqcew['own_code'] !=0) |
                                      (blsqcew['own_code'] !=8) |
                                      (blsqcew['own_code'] !=9)]

  # Replace Industry code for NAICS 92 to get levels of government
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==1),'industry_code'] = '92 1 Federal Government'
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                    (blsqcew_2digit['own_code'] ==2),'industry_code'] = '92 2 State Government'
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                    (blsqcew_2digit['own_code'] ==3),'industry_code'] = '92 3 Local Government'

  table1 = blsqcew_2digit.groupby(by=["industry_code","industry_title"]).sum()
  table1.reset_index(inplace = True)
  table_title = "Two-digit NAICS, "+area_title
  varformat = {('annual_avg_emplvl'): "{:,.0f}", ('annual_avg_estabs'):"{:,.0f}"}
  table1_fmt = table1.style\
      .set_caption(table_title)\
      .format(varformat)

  # renanme columns 

  # Save results as csv
  csv_filepath = 'BLSQCEW_'+year+"_"+area_fips+'.csv'
  savefile = csv_filepath
  print(savefile)
  table1.to_csv(savefile, index=False)

  return table1_fmt

obtain_clean_bls()

BLSQCEW_2016_US000.csv